# потрійні лапки все розуміють як суцільний текст
st = """
'не" важливо, що \тут написано : і як c:\\temp
"""
print(st)

# екранування лапок та слешів
sr = 'c:\\windows\\temp'
print(sr)

# щоб не екранувати кожний символ перед рядком прописуємо r
sa = r'c:\windows\temp'
print(sa)

# для переносу рядка на новий ставимо \n
sd = 'для переносу рядка на \nновий ставимо "\\n"'
print(sd)

# щоб додати табуляцію в текст прописуємо \t
print('тут додаємо \tтабуляцію')

# витягнути елемент зі строки за номером
greet = str('tse ryadok')
print(greet[5])

# рядки - НЕЗМІННІ! Тому, для зміни рядка можна виставити індекси елементів (з якого по який)
# треба перенести в новий рядок
greetCopy = greet[5:]
print(greetCopy)

# для виборки елементів можна вказати з якого по який елемент взяти і з яким кроком
print(sd[2:18:2])

# виведення сивола N разів
a = 'a'
print(a*7)